[
    {
        "id":1,
        "route":"project/AllAboutTheUniverse",
        "title":"All About The Universe",
        "blurb":"Welcome to the 'All About the Universe' project! This project aims to provide users with information about the planets, an introduction to the International Space Station (ISS), and a daily Astronomy Picture of the Day (APOD) from NASA.",
        "detailDescription":"Welcome to the 'All About the Universe' project! This is the project leveraged Node.js and integrated 4 different APIs to create a dynamic and educational web application about the universe. It aims to provide users with information about the planets, the current position of the International Space Station (ISS), and a daily Astronomy Picture of the Day (APOD) from NASA.",
        "function1Heading":"Function 1: Astronomy Picture of the Day (APOD)",
        "function1":"The first function fetches the Astronomy Picture of the Day (APOD) from NASA's API. Users will be able to select the date and view stunning and captivating images of various astronomical phenomena taken by space telescopes, rovers, and other spacecraft.",
        "function2Heading":"Function 2: Where the International Space Station (ISS) at?",
        "function2":"The second function provides users with the current location of the International Space Station (ISS) along with basic information about the ISS. Users will be able to view an embedded Google Map displaying the real-time position of the ISS as it orbits the Earth.",
        "function3Heading":"Function 3: Discover the Planets",
        "function3":"The third function allows users to explore basic information about the planets in our solar system. Users can access details such as the planet's name, diameter, distance from the Sun, average temperature, and other fascinating facts.",
        "image":"projectPhoto/AllAboutTheUniverse.png",
        "imageForDetail":"../projectPhoto/AllAboutTheUniverse.png",
        "deployingUrl":"https://github.com/YujiaWang6/AllAboutTheUniverse_NodeJS",
        "githubUrl":"https://github.com/YujiaWang6/AllAboutTheUniverse_NodeJS",
        "languages":
            [
                {
                    "id":2,
                    "name":"CSS",
                    "icon":"icon/css.svg",
                    "alt":"image icon of CSS"
                },
                {
                    "id":6,
                    "name":"Node.JS",
                    "icon":"icon/nodejs.svg",
                    "alt":"image icon of Node.JS"
                }

            ]
    },
    {
        "id":2,
        "route":"project/E-Commerce-CMS",
        "title":"E-Commerce CMS",
        "blurb":"Welcome to the E-Commerce CMS project, a content management system(CMS) built using the Laravel framework for managing an E-Commerce store's brands, categories, and products.",
        "detailDescription":"Welcome to the E-Commerce CMS project, a content management system(CMS) built using the Laravel framework for managing an E-Commerce store's brands, categories, and products.It empowers authenticated users to perform CRUD (Create, Read, Update, Delete) operations on brands, categories, and products, enabling efficient management of the store's content.",
        "function1Heading":"Function 1: User Authentication",
        "function1":"Secure user authentication system is in place to ensure only authorized users can access and manage the content.",
        "function2Heading":"Function 2: CURD functions",
        "function2":"The users can Add, edit, view, and delete different brands for products, manage product categories with ease, including creation, editing, and deletion. And full CRUD functionality for products, allowing easy addition, updating, and removal.",
        "function3Heading":"Function 3: Responsive Design",
        "function3":"The user interface is designed to be responsive, ensuring a consistent experience across devices.",
        "image":"projectPhoto/CMS2.png",
        "imageForDetail":"../projectPhoto/CMS2.png",
        "deployingUrl":"http://13.59.213.85/",
        "githubUrl":"https://github.com/YujiaWang6/E-Commerce_CMS",
        "languages":
            [
                {
                    "id":9,
                    "name":"PHP",
                    "icon":"icon/php.svg",
                    "alt":"image icon of PHP"
                },
                {
                    "id":11,
                    "name":"Laravel",
                    "icon":"icon/laravel.svg",
                    "alt":"image icon of Laravel"
                },
                {
                    "id":10,
                    "name":"MySQL",
                    "icon":"icon/mysql.svg",
                    "alt":"image icon of MySQL"
                },
                {
                    "id":12,
                    "name":"AWS",
                    "icon":"icon/aws.svg",
                    "alt":"image icon of AWS"
                }

            ]
    },
    {
        "id":3,
        "route":"project/BeadKeychainDesignPlatform",
        "title":"Bead Keychain Design Platform",
        "blurb":"Welcome to the Bead Keychain Design Platform! This platform is built to replace the bead design board in the real world!",
        "detailDescription":"Welcome to the Bead Keychain Design Platform! This platform is built using C# Entity frameworks and it supposes to replace the bead design board in the real world! This platform support users to manage their beads, upload the image of beads to visualize exact look of that specific bead. Moreover, there is keychain option which allow user to create their own keychain online! They can add/remove the bead to/from a specific keychain, in that specific keychain, they can see the pictures of all the beads in that keychain.",
        "function1Heading":"Function 1: User Authentication",
        "function1":"Secure user authentication system is used in this project to only allow registrated users to access create, update and delete functions.",
        "function2Heading":"Function 2: CURD functions and association between bead and keychain",
        "function2":"Full CURD functions on bead, bead colour and keychain tables which allow users to manage their beads online, see the beads related to a specific bead colour and associate/unassociate with a bead to a specific keychain.",
        "function3Heading":"Function 3: Image upload function",
        "function3":"It allows users to store their beads online, including uploaded the image of beads to visualize exact look of that specific bead.",
        "image":"projectPhoto/keychainDesign.PNG",
        "imageForDetail":"../projectPhoto/keychainDesign.PNG",
        "deployingUrl":"https://www.youtube.com/watch?v=P_AozuE1GIU&ab_channel=Helennn_W",
        "githubUrl":"https://github.com/YujiaWang6/BeadKeychainDesignPlatform",
        "languages":
            [
                {
                    "id":4,
                    "name":"C#",
                    "icon":"icon/csharp.svg",
                    "alt":"image icon of C sharp"
                },
                {
                    "id":5,
                    "name":"ASP.NET",
                    "icon":"icon/aspNET.svg",
                    "alt":"image icon of ASP.NET"
                },
                {
                    "id":1,
                    "name":"HTML",
                    "icon":"icon/html.svg",
                    "alt":"image icon of HTML"
                },
                {
                    "id":2,
                    "name":"CSS",
                    "icon":"icon/css.svg",
                    "alt":"image icon of CSS"
                },
                {
                    "id":3,
                    "name":"JAVASCRIPT",
                    "icon":"icon/javascript.svg",
                    "alt":"image icon of JAVASCRIPT"
                },
                {
                    "id":13,
                    "name":"Bootstrap",
                    "icon":"icon/bootstrap.svg",
                    "alt":"image icon of Bootstrap"
                }

            ]
    },
    {
        "id":4,
        "route":"project/GIFPhotoBooth",
        "title":"GIF Photo Booth",
        "blurb":"This project is a fun and quirky online photo booth where users can interact with a cute animated puppy dog character. Users have the ability to switch between different animated backgrounds and customize the accessories for the puppy dog, creating delightful and entertaining GIFs.",
        "detailDescription":"This project is a fun and quirky online photo booth where users can interact with a cute animated puppy dog character. Users have the ability to switch between different animated backgrounds and customize the accessories for the puppy dog, creating delightful and entertaining GIFs. This project is a pure CSS drawing and animation project which all the dog figure, animated backgrounds and accessories are drawn in CSS code",
        "function1Heading":"Function 1: Animated dog figures & Animated Backgrounds",
        "function1":"As the concept of GIF photo, all the figures and backgrounds are drawn and animated by using CSS.",
        "function2Heading":"Function 2: Responsive Design",
        "function2":"The user interface is designed to be responsive, ensuring a consistent experience across devices.",
        "function3Heading":"",
        "function3":"",
        "image":"projectPhoto/photoBooth.png",
        "imageForDetail":"../projectPhoto/photoBooth.png",
        "deployingUrl":"https://yujiawang6.github.io/GIF-Photo-Booth/",
        "githubUrl":"https://github.com/YujiaWang6/GIF-Photo-Booth",
        "languages":
            [
                
                {
                    "id":1,
                    "name":"HTML",
                    "icon":"icon/html.svg",
                    "alt":"image icon of HTML"
                },
                {
                    "id":2,
                    "name":"CSS",
                    "icon":"icon/css.svg",
                    "alt":"image icon of CSS"
                },
                {
                    "id":3,
                    "name":"JAVASCRIPT",
                    "icon":"icon/javascript.svg",
                    "alt":"image icon of JAVASCRIPT"
                }

            ]
    }
]